namespace Task_3_CreditCard
{/*Задание 3
Создайте класс «Кредитная карточка». Класс должен
содержать:
■ Номер карты;
■ ФИО владельца;
■ Срок действия карты;
■ PIN;
■ Кредитный лимит;
■ Сумма денег.

Создайте необходимый набор методов класса. Реализуйте события для следующих ситуаций:
■ Пополнение счёта;
■ Расход денег со счёта;
■ Старт использования кредитных денег;
■ Достижение заданной суммы денег;
■ Смена PIN*/
    internal class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}
